MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/bmx/processor/bmx_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_BMX_ExistsBusExceptionDMA(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsBusExceptionDMA_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionDMAEnable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionDMAEnable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionDMADisable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionDMADisable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsBusExceptionData(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsBusExceptionData_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionDataEnable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionDataEnable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionDataDisable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionDataDisable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsBusExceptionInstruction(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsBusExceptionInstruction_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionInstructionEnable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionInstructionEnable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_BMX_BusExceptionInstructionDisable(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_BusExceptionInstructionDisable_Default(index);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsProgramFlashPartition(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsProgramFlashPartition_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API size_t PLIB_BMX_ProgramFlashPartitionGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ProgramFlashPartitionGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (size_t)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_ProgramFlashPartitionSet(BMX_MODULE_ID index, size_t user_size)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_ProgramFlashPartitionSet_Default(index, user_size);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsDataRAMPartition(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsDataRAMPartition_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_BMX_DataRAMPartitionSet(BMX_MODULE_ID index, size_t kernProgOffset, size_t userDataOffset, size_t userProgOffset)
{
    switch (index) {
        case BMX_ID_0 :
            BMX_DataRAMPartitionSet_Default(index, kernProgOffset, userDataOffset, userProgOffset);
            break;
        case BMX_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API size_t PLIB_BMX_DataRAMKernelProgramOffsetGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_DataRAMKernelProgramOffsetGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (size_t)0;
    }
}

PLIB_INLINE_API size_t PLIB_BMX_DataRAMUserDataOffsetGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_DataRAMUserDataOffsetGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (size_t)0;
    }
}

PLIB_INLINE_API size_t PLIB_BMX_DataRAMUserProgramOffsetGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_DataRAMUserProgramOffsetGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (size_t)0;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsProgramFlashMemorySize(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsProgramFlashMemorySize_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API size_t PLIB_BMX_ProgramFlashMemorySizeGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ProgramFlashMemorySizeGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (size_t)0;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsDataRAMSize(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsDataRAMSize_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API size_t PLIB_BMX_DataRAMSizeGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_DataRAMSizeGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (size_t)0;
    }
}

PLIB_INLINE_API bool PLIB_BMX_ExistsProgramFlashBootSize(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ExistsProgramFlashBootSize_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API size_t PLIB_BMX_ProgramFlashBootSizeGet(BMX_MODULE_ID index)
{
    switch (index) {
        case BMX_ID_0 :
            return BMX_ProgramFlashBootSizeGet_Default(index);
        case BMX_NUMBER_OF_MODULES :
        default :
            return (size_t)0;
    }
}

#endif
